Drop in Data

Usage
| where DataType == "<DataType>"
| make-series DailyTotal = sum(Quantity), z=0 on TimeGenerated from startofday(ago(10d)) to now() step 1d
| render timechart

Specfic search


SecurityEvent
| where TimeGenerated > ago(1h)
| where EventID == 4624
| where AccountType =~ "user"


Sys Log Search 

let timeframe = 1d;

let DomainList = dynamic(["tor2web.org", "tor2web.com"]);

Syslog
| where TimeGenerated >= ago(timeframe)
| where ProcessName contains "squid"
| extend 
  HTTP_Status_Code = extract("(TCP_(([A-Z]+)…-9]{3}))",8,SyslogMessage),    
  Domain = extract("(([A-Z]+ [a-z]{4…Z]+ )([^ :\\/]*))",3,SyslogMessage)
| where HTTP_Status_Code == "200"
| where Domain contains "."
| where Domain has_any (DomainList)


Show Computers under a Certain event

SecurityEvent
| project Computer, Account

Search Specific File

DeviceFileEvents
| where * contains "log4j"
| distinct DeviceName, InitiatingProcessFolderPath


Cloud App Events


CloudAppEvents
| where Timestamp > datetime("2021-12-09")
| where UserAgent contains "jndi:" 
or AccountDisplayName contains "jndi:"
or Application contains "jndi:"
or AdditionalFields contains "jndi:"
| project ActionType, ActivityType, Application, AccountDisplayName, IPAddress, UserAgent, AdditionalFields


W3IIISLog

W3CIISLog
| where Computer == "VMName" and csUserName == "-"
| project-reorder TimeGenerated, cIP, csUserName, csUriStem, csUriQuery, scStatus, csReferer
| order by TimeGenerated desc


Exchange WorkFlows

OfficeActivity 
| where OfficeWorkload =~ "Exchange" and Operation =~ "MailItemsAccessed" and ResultStatus =~ "Succeeded"
| make-series count() on TimeGenerated from startofday(ago(14d)) to startofday(now()) step 1h
| render timechart 


OfficeActivity 
| where OfficeWorkload =~ "Exchange" and Operation =~ "MailItemsAccessed" and ResultStatus =~ "Succeeded"
| make-series count() on TimeGenerated from startofday(ago(30d)) to startofday(now()) step 1d
| render timechart 


Palo Alto Alerts

DnsEvents

| where Name == "<domain name from the PA threat list>"


FIM Alerts

ConfigurationChange
| where Computer !contains "WIN10"
| where RegistryKey == "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Group Policy\\Scripts\\Startup"
    or RegistryKey == "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Group Policy\\Scripts\\Shutdown"
    or RegistryKey == "HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Drivers32"
    or RegistryKey == "HKEY_LOCAL_MACHINE\\Software\\Wow6432Node\\Microsoft\\Windows NT\\CurrentVersion\\Drivers32"
    or RegistryKey == "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run"
    or RegistryKey == "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run"
    or RegistryKey == "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnce"
    or RegistryKey == "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx"



CommonSecurityLog
| where Activity == "THREAT" and SourceIP == "InsertIP"
| project TimeGenerated, SourceIP, DestinationIP, DeviceEventClassID, RequestURL
| order by TimeGenerated desc

Event
| where EventLog == "Application"
| where Source == "MSSQLSERVER"
| where EventID == 18453 // This is the Event ID for SQL Login Succeeded
| summarize count() by Computer


If you would like to know where a denied traffic comes from a specific IP address:

AzureDiagnostics 
| where ResourceType == "AZUREFIREWALLS" 
    and msg_s contains "request from InsertIP" 
    and msg_s contains "Deny"


search for user

SigninLogs
| where UserPrincipleName == "insert"
| project UserPrincipalName, AppDisplayName, ResultType, ResultDescription

Get the list of users who have had failed Windows logins, the count of the failures, and the list of servers that they've failed logins to: 

 

SecurityEvent 

| where EventID == 4625 

| summarize FailureCount = count(), VMList = make_set(Computer) by Account 

 

Get the list of successful logins from outside the US to Azure AD 

 

SigninLogs 

| where ResultType == "0" 

| where LocationDetails.countryOrRegion <> "US" 

 

Get the PA traffic logs for traffic to a specific IP, with only the relevant columns returned (including the firewall security rule that allowed or blocked the traffic) 

 

let IPToSearchFor = "8.8.8.8"; 

CommonSecurityLog 

| where Activity == "TRAFFIC" 

| where SourceIP == IPToSearchFor or DestinationIP == IPToSearchFor 

| parse AdditionalExtensions with "PolicyRule=" PolicyRule ";" * 

| project TimeGenerated, SourceIP, SourcePort, DestinationIP, DestinationPort, ApplicationProtocol, DeviceEventClassID, PolicyRule 

| order by TimeGenerated desc 

 

Get the number of daily IDS/IPS threats for the last 30 days in graphical form, broken up by the action taken by the PA 

 

CommonSecurityLog 

| where Activity == "THREAT" 

| make-series count() on TimeGenerated from ago(30d) to now() step 1d by SimplifiedDeviceAction 

| render timechart  

 

Search the Azure Activity log for the last 30 days for any log that includes the string "VirtualMachine" in it.  Note that this can be pretty slow and should be avoided unless you don't know which column the data you're looking for is in. 

 

AzureActivity 

| where TimeGenerated > ago(30d) 

| where * contains "VirtualMachine" 


let GetAllLogonsForUser = (v_Account_Name: string, v_Account_NTDomain: string) {
    let AllEvents = SecurityEvent
        | extend p_Account_Name = case(
            // Handles mixed use scenario of NTDomain\AccountName@UPNSuffix
            v_Account_Name has '@' and v_Account_Name has '\\', tostring(split(tostring(split(v_Account_Name, '\\')[1]), '@')[0]),
            v_Account_Name has '@', tostring(split(v_Account_Name, '@')[0]),
            v_Account_Name has '\\', tostring(split(v_Account_Name, '\\')[1]),
            v_Account_Name
            )
        | extend p_Account_NTDomain = case(
            v_Account_NTDomain has '\\', tostring(split(v_Account_NTDomain, '\\')[0]), 
            // Handles UPN scenario of AccountName@UPNSuffix to pull potential NTDomain from
            v_Account_NTDomain has '@', tostring(split(tostring(split(v_Account_NTDomain, '@')[1]), '.')[0]),
            v_Account_NTDomain
            )
        | where EventID in (4624, 4625, 4672)
        | where AccountType =~ 'User'
        | where TargetUserName =~ p_Account_Name and TargetDomainName =~ p_Account_NTDomain
        | extend
            PassedInAccountName = p_Account_Name,
            PassedInNTDomain = p_Account_NTDomain,
            RelatedRowSet = 'AllEvents'
        | extend
            HourOfLogin = hourofday(TimeGenerated),
            DayNumberofWeek = dayofweek(TimeGenerated)
        | extend DayofWeek = case(
            DayNumberofWeek == "00:00:00", "Sunday", 
            DayNumberofWeek == "1.00:00:00", "Monday", 
            DayNumberofWeek == "2.00:00:00", "Tuesday", 
            DayNumberofWeek == "3.00:00:00", "Wednesday", 
            DayNumberofWeek == "4.00:00:00", "Thursday", 
            DayNumberofWeek == "5.00:00:00", "Friday", 
            DayNumberofWeek == "6.00:00:00", "Saturday", "InvalidTimeStamp")
        // map the most common ntstatus codes
        | extend StatusDesc = case(
            Status =~ "0x80090302", "SEC_E_UNSUPPORTED_FUNCTION",
            Status =~ "0x80090308", "SEC_E_INVALID_TOKEN",
            Status =~ "0x8009030E", "SEC_E_NO_CREDENTIALS",
            Status =~ "0xC0000008", "STATUS_INVALID_HANDLE",
            Status =~ "0xC0000017", "STATUS_NO_MEMORY",
            Status =~ "0xC0000022", "STATUS_ACCESS_DENIED",
            Status =~ "0xC0000034", "STATUS_OBJECT_NAME_NOT_FOUND",
            Status =~ "0xC000005E", "STATUS_NO_LOGON_SERVERS",
            Status =~ "0xC000006A", "STATUS_WRONG_PASSWORD",
            Status =~ "0xC000006D", "STATUS_LOGON_FAILURE",
            Status =~ "0xC000006E", "STATUS_ACCOUNT_RESTRICTION",
            Status =~ "0xC0000073", "STATUS_NONE_MAPPED",
            Status =~ "0xC00000FE", "STATUS_NO_SUCH_PACKAGE",
            Status =~ "0xC000009A", "STATUS_INSUFFICIENT_RESOURCES",
            Status =~ "0xC00000DC", "STATUS_INVALID_SERVER_STATE",
            Status =~ "0xC0000106", "STATUS_NAME_TOO_LONG",
            Status =~ "0xC000010B", "STATUS_INVALID_LOGON_TYPE",
            Status =~ "0xC000015B", "STATUS_LOGON_TYPE_NOT_GRANTED",
            Status =~ "0xC000018B", "STATUS_NO_TRUST_SAM_ACCOUNT",
            Status =~ "0xC0000224", "STATUS_PASSWORD_MUST_CHANGE",
            Status =~ "0xC0000234", "STATUS_ACCOUNT_LOCKED_OUT",
            Status =~ "0xC00002EE", "STATUS_UNFINISHED_CONTEXT_DELETED",
            EventID == 4624 or EventID == 4672, "Success",
            "See - https://docs.microsoft.com/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55"
            )
        | extend SubStatusDesc = case(
            SubStatus =~ "0x80090325", "SEC_E_UNTRUSTED_ROOT",
            SubStatus =~ "0xC0000008", "STATUS_INVALID_HANDLE",
            SubStatus =~ "0xC0000022", "STATUS_ACCESS_DENIED",
            SubStatus =~ "0xC0000064", "STATUS_NO_SUCH_USER",
            SubStatus =~ "0xC000006A", "STATUS_WRONG_PASSWORD",
            SubStatus =~ "0xC000006D", "STATUS_LOGON_FAILURE",
            SubStatus =~ "0xC000006E", "STATUS_ACCOUNT_RESTRICTION",
            SubStatus =~ "0xC000006F", "STATUS_INVALID_LOGON_HOURS",
            SubStatus =~ "0xC0000070", "STATUS_INVALID_WORKSTATION",
            SubStatus =~ "0xC0000071", "STATUS_PASSWORD_EXPIRED",
            SubStatus =~ "0xC0000072", "STATUS_ACCOUNT_DISABLED",
            SubStatus =~ "0xC0000073", "STATUS_NONE_MAPPED",
            SubStatus =~ "0xC00000DC", "STATUS_INVALID_SERVER_STATE",
            SubStatus =~ "0xC0000133", "STATUS_TIME_DIFFERENCE_AT_DC",
            SubStatus =~ "0xC000018D", "STATUS_TRUSTED_RELATIONSHIP_FAILURE",
            SubStatus =~ "0xC0000193", "STATUS_ACCOUNT_EXPIRED",
            SubStatus =~ "0xC0000380", "STATUS_SMARTCARD_WRONG_PIN",
            SubStatus =~ "0xC0000381", "STATUS_SMARTCARD_CARD_BLOCKED",
            SubStatus =~ "0xC0000382", "STATUS_SMARTCARD_CARD_NOT_AUTHENTICATED",
            SubStatus =~ "0xC0000383", "STATUS_SMARTCARD_NO_CARD",
            SubStatus =~ "0xC0000384", "STATUS_SMARTCARD_NO_KEY_CONTAINER",
            SubStatus =~ "0xC0000385", "STATUS_SMARTCARD_NO_CERTIFICATE",
            SubStatus =~ "0xC0000386", "STATUS_SMARTCARD_NO_KEYSET",
            SubStatus =~ "0xC0000387", "STATUS_SMARTCARD_IO_ERROR",
            SubStatus =~ "0xC0000388", "STATUS_DOWNGRADE_DETECTED",
            SubStatus =~ "0xC0000389", "STATUS_SMARTCARD_CERT_REVOKED",
            EventID == 4624 or EventID == 4672, "Success",
            "See - https://docs.microsoft.com/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55"
            )
        | project
            StartTime = TimeGenerated,
            DayofWeek,
            HourOfLogin,
            EventID,
            Activity,
            IpAddress,
            WorkstationName,
            Computer,
            TargetUserName,
            TargetDomainName,
            ProcessName,
            SubjectUserName,
            PrivilegeList,
            PassedInAccountName,
            PassedInNTDomain,
            LogonTypeName,
            StatusDesc,
            SubStatusDesc,
            RelatedRowSet 
    ;
    let UserSigninToSystems = AllEvents
        | where EventID == 4624
        | project-away StatusDesc, SubStatusDesc, PrivilegeList
        | summarize
            Total= count(),
            max(HourOfLogin),
            min(HourOfLogin),
            historical_DayofWeek=make_set(DayofWeek),
            StartTime=max(StartTime),
            EndTime = min(StartTime),
            SourceIP = make_set(IpAddress),
            SourceHost = make_set(WorkstationName),
            SubjectUserName = make_set(SubjectUserName),
            HostLoggedOn = make_set(Computer)
            by
            EventID,
            Activity,
            TargetDomainName,
            TargetUserName,
            ProcessName,
            LogonTypeName
        | extend RelatedRowSet = 'UserSigninToSystems';
    let UserFailedSigninToSystems = AllEvents
        | where EventID == 4625
        | project-away PrivilegeList
        | summarize
            Total= count(),
            max(HourOfLogin),
            min(HourOfLogin),
            historical_DayofWeek=make_set(DayofWeek),
            StartTime=max(StartTime),
            EndTime = min(StartTime),
            SourceIP = make_set(IpAddress),
            SourceHost = make_set(WorkstationName),
            SubjectUserName = make_set(SubjectUserName),
            HostLoggedOn = make_set(Computer)
            by
            EventID,
            Activity,
            TargetDomainName,
            TargetUserName,
            ProcessName,
            LogonTypeName
        | extend RelatedRowSet = 'UserFailedSigninToSystems';
    let UserSigninDuringAbnormalHours = AllEvents
        | where StartTime between (ago(14d) .. ago(2d))
        | where EventID in (4624, 4625)
        | where LogonTypeName in~ ('2 - Interactive', '10 - RemoteInteractive')
        | summarize max(HourOfLogin), min(HourOfLogin), historical_DayofWeek=make_set(DayofWeek) by TargetUserName
        | join kind= inner
            (
            AllEvents
            | where StartTime > ago(2d)
            | where LogonTypeName in~ ('2 - Interactive', '10 - RemoteInteractive')
            )
            on TargetUserName
        | where HourOfLogin > max_HourOfLogin or HourOfLogin < min_HourOfLogin
        | extend historical_DayofWeek = tostring(historical_DayofWeek)
        | summarize
            Total= count(),
            max(HourOfLogin),
            min(HourOfLogin),
            current_DayofWeek =make_set(DayofWeek),
            StartTime=max(StartTime),
            EndTime = min(StartTime),
            SourceIP = make_set(IpAddress),
            SourceHost = make_set(WorkstationName),
            SubjectUserName = make_set(SubjectUserName),
            HostLoggedOn = make_set(Computer)
            by
            EventID,
            Activity,
            TargetDomainName,
            TargetUserName,
            ProcessName,
            LogonTypeName,
            StatusDesc,
            SubStatusDesc,
            historical_DayofWeek
        | extend historical_DayofWeek = todynamic(historical_DayofWeek) 
        | extend RelatedRowSet = 'UserSigninDuringAbnormalHour'; 
    let UserHadPrivilegedLogonSessions = AllEvents
        | where EventID == 4672
        | where PrivilegeList contains 'SeDebugPrivilege'
        | project-away StatusDesc, SubStatusDesc
        | summarize
            Total= count(),
            max(HourOfLogin),
            min(HourOfLogin),
            historical_DayofWeek=make_set(DayofWeek),
            StartTime=max(StartTime),
            EndTime = min(StartTime),
            SourceIP = make_set(IpAddress),
            SourceHost = make_set(WorkstationName),
            SubjectUserName = make_set(SubjectUserName),
            HostLoggedOn = make_set(Computer)
            by EventID, Activity, PrivilegeList
        // Notice! summarize removes the TimeGenerated field, which is required for Activities.
        | extend RelatedRowSet = 'UserHadPrivilegedLogonSessions';
    union isfuzzy=true
        AllEvents,
        UserSigninToSystems,
        UserFailedSigninToSystems,
        UserSigninDuringAbnormalHours,
        UserHadPrivilegedLogonSessions
};
// change user value below to the username you are interested in and domain to the domain of the user you are interested in
GetAllLogonsForUser('username', 'domain')
| where RelatedRowSet =~ 'AllEvents'
| where EventID in (4624, 4625, 4672)
| extend SubjectUserName = columnifexists('SubjectUserName', 'EventDoesNotContain')
| summarize
    Total= count(),
    max(HourOfLogin),
    min(HourOfLogin),
    historical_DayofWeek=make_set(DayofWeek),
    StartTime=max(StartTime),
    EndTime = min(StartTime),
    SourceIP = make_set(IpAddress),
    SourceHost = make_set(WorkstationName),
    SubjectUserName = make_set(SubjectUserName),
    HostLoggedOn = make_set(Computer)
    by Activity, TargetDomainName, TargetUserName, ProcessName, LogonTypeName
| extend NumberOfHostsLoggedOn = array_length(HostLoggedOn)
